Repository: OpenChain-KWG/Curriculum-Translation-KR
Catalog: openchain-curriculum-kr-level1.tmx
Source language: en_us
Languages: ko

source: "Distributed Compliance Artifacts" (as defined in the OpenChain specification), including appropriate notice files are included in the distribution package or other delivery method
ko: 적절한 고지 파일을 포함하는(OpenChain 설명서에 정의된) "배포할 컴플라이언스 결과물"은 배포 패키지 혹은 다른 전달 방법에 포함됩니다.

source: 3rd Party Commercial
ko: 제3자 상용

source: 3rd Party Software
ko: 타사 소프트웨어

source: <<This is a placeholder slide to identify where your FOSS policy can be found (OpenChain Specification 1.1, section 1.1.1)>>
ko: <<이것은 당신의 FOSS 정책이 어디서 발견될 수 있는지 에 대해 알려주기 위한 견본용 슬라이드 입니다. (OpenChain 설명서 1.1, 1.1.1절)>>

source: A FOSS Review can be the meeting point for engineering, business and legal teams, and can require planning and organization to successfully conduct on a large scale.
ko: FOSS 리뷰는 엔지니어링, 비즈니스 및 법률 팀의 미팅 포인트가 될 수 있으며, 큰규모에서도 성공적으로 수행하기 위한 계획과 조직이 필요할 수 있습니다.

source: A FOSS Review team includes the company representatives that support, guide, coordinate and review the use of FOSS.
ko: FOSS 리뷰 팀에는 FOSS 사용을 지원, 안내, 조정 및 검토하는 회사 대표자가 포함됩니다.

source: A complete list of OSI-approved licenses is available at http://www.opensource.org/licenses/
ko: OSI 승인 전체 라이선스 목록은 다음에서 볼 수 있음 : http://www.opensource.org/licenses/

source: A compliance record is created (or updated) for the FOSS
ko: FOSS에 대한 컴플라이언스 기록이 생성(또는 업데이트)됩니다.

source: A developer may copy portions of a FOSS component into your software product.
ko: 개발자는 FOSS 컴포넌트의 일부를 소프트웨어 제품에 복사할 수 있습니다.

source: A developer may link or join a FOSS component with your software product.
ko: 개발자는 FOSS 컴포넌트를 소프트웨어 제품과 링크하거나 연결할 수 있습니다.

source: A developer may make changes to a FOSS component, including:
ko: 개발자는 다음을 포함하여 FOSS 컴포넌트를 변경할 수 있습니다.:

source: A developer may transform the code from one state to another.
ko: 개발자는 코드를 한 상태에서 다른 상태로 변환 할 수 있습니다.

source: A good example of freely available source code scanning tool is FOSSology,a project hosted by the Linux Foundation:https://www.fossology.org
ko: 무료로 사용할 수 있는 소스 코드 스캐닝 도구의 좋은 예는 Linux Foundatoin에서 호스팅하는 프로젝트인 FOSSology입니다. : http://fossology.org

source: A key element to a FOSS Compliance Program is a FOSS Review process.
ko: FOSS 컴플라이언스 프로그램의 핵심 요소는 FOSS 리뷰 프로세스입니다.

source: A patent application must be made in a specific jurisdiction in order to obtain a patent in that country. If a patent is awarded, the owner has the right to stop anybody from exercising its functionality, regardless of independent creation
ko: 해당 국가에서 특허를 얻기 위해서는 특정 관할 지역에서 특허 신청을해야함. 특허가 수여되면 소유자는 독립적인 창작과 상관없이 누구나 그 기능을 행사할 수 없도록 제한할 권리가 있음

source: A proprietary software license (or commercial license or EULA) has restrictions on the usage, modification and/or distribution of the software
ko: 독점 소프트웨어 라이선스 (또는 상업용 라이선스 또는 EULA)는 소프트웨어의 사용, 수정 및 배포에 대한 제한을 가짐.

source: A resolution for each of the flagged files in the report and a resolution for any flagged license conflict
ko: 보고서 내 플래그가 지정된 각 파일에 대한 해결 방법 및 플래그가 지정된 라이선스 충돌에 대한 해결 방법

source: A “license” is the way a copyright or patent holder gives permission or rights to someone else
ko: "라이선스"는 저작권 또는 특허권 소유자가 다른 사람에게 허가 또는 권리를 부여하는 방식임

source: Accompanying source code distribution
ko: 수반되는 소스 코드 배포

source: Accompanying source code is identified with labels as to which product and version to which it corresponds
ko: 수반되는 소스 코드는 해당하는 제품 및 버전에 대한 레이블로 식별됩니다.

source: Acknowledge the use of FOSS by providing full copyright and attribution notices
ko: 모든 저작권 및 귀속에 관한 고지를 제공함으로써 FOSS의 사용을 알립니다.

source: Adapting
ko: 개작 (Adapting)

source: Adapt existing Business Processes to support the FOSS compliance program
ko: FOSS 컴플라이언스 프로그램을 지원하기 위해 기존 비지니스 프로세스를 수정합니다.

source: Adding
ko: 추가 (Adding)

source: Adding/injecting new code into the FOSS component
ko: FOSS 컴포넌트에 새로운 코드 추가 / 주입

source: After Program and Product Management and Engineers have reviewed proposed FOSS components for usefulness and quality, a review of the rights and obligationsassociated with the use of the selected components should be initiated
ko: 유용성 및 품질을 위해 제안된 FOSS 컴포넌트에 대해 프로그램 및 제품 관리자와 엔지니어가 검토 한 후, 선택한 컴포넌트의 사용과 관련된 권리 및 의무에 대한 검토가 시작되어야 합니다.

source: All of the solutions address specific needs and - for that reason - none will solve all possible challenges
ko: 모든 솔루션은 특정 요구 사항들을 처리하기 때문에 모든 원인을 해결할 수있는 솔루션은 없습니다.

source: An audit is requested to review the source code with a scope a defined as exhaustive or limited according to FOSS policy requirements.
ko: FOSS 정책 요구사항에 따라 포괄적이거나 제한적으로 정의된 범위로 소스 코드를 리뷰하도록 검사가 요청됩니다.

source: An audit report identifying:
ko: 다음을 식별하는 검사 보고서:

source: Analyze and understand license obligations
ko: 라이선스 의무 분석 및 이해

source: Analyzing Proposed FOSS Usage
ko: 제안된 FOSS 사용 분석

source: Another legal entity within the business group (this may count as distribution)
ko: 비지니스 그룹 내 다른 법인 (이는 배포로 간주될 수 있음)

source: Anyone working with FOSS in the company should be able to initiate a FOSS Review, including Program or Product Managers, Engineers, and Legal.
ko: 프로그램 또는 제품 관리자, 엔지니어, 법무팀을 포함하여 회사내에서 FOSS 관련 일을 하는 사람은 누구든지 FOSS 리뷰를 시작할 수 있어야 합니다.

source: Approvals
ko: 승인

source: Approvals should be made at appropriate authority levels
ko: 승인은 적절할 수준의 권한에서 이루어져야 합니다.

source: Architecture Review (Example Template)
ko: 아키텍처 리뷰 (예제 템플릿)

source: Attribution and other notices and URLs
ko: 저작자 및 다른 고지와 URL

source: Audit
ko: 검사

source: Audit source code
ko: 소스 코드 검사

source: Auditing Source Code
ko: 소스 코드 검사

source: Audits or scans are performed iteratively based on the software development and release lifecycles
ko: 검사 또는 스캔은 소프트웨어 개발 및 출시 주기에따라 반복적으로 수행됩니다.

source: Avoiding Compliance Pitfalls
ko: Compliance 함정 피하기

source: Based on the results of the software audit and review in previous steps, software may or may not be approved for use
ko: 이전 단계의 소프트웨어 검사 및 리뷰 결과에 따라 소프트웨어 사용이 승인되거나 승인되지 않을 수 있습니다.

source: Basic rule: copyright protects creative works
ko: 기본 규칙 : 저작권은 창작물을 보호

source: Because FOSS licenses usually apply during distribution, this is a key point to consider in a compliance program.
ko: FOSS 라이선스는 일반적으로 배포할때 적용되므로 컴플라이언스 프로그램에서 고려해야할 핵심 사항입니다.

source: Binary delivery
ko: 바이너리 전달

source: Business and engineering teams may receive and implement guidance
ko: 비즈니스 및 엔지니어링 팀은 가이드를 받아 이행할 수 있습니다.

source: CHAPTER 1
ko: 1장

source: CHAPTER 2
ko: 2장

source: CURRICULUM
ko: 교육과정

source: Can software be subject to a patent?
ko: 소프트웨어가 특허 대상이 될 수 있습니까?

source: Changing
ko: 변경 (Changing)

source: Check Your Understanding
ko: 확인해보세요

source: Check information for completeness, consistency and accuracy.
ko: 완전성, 일관성 및 정확성에 대한 정보를 확인하십시오.

source: Combining
ko: 결합 (Combining)

source: Common scenarios include:
ko: 일반적인 시나리오는 다음과 같습니다:

source: Community project
ko: 커뮤니티 프로젝트

source: Companies may have similar processes in place for proprietary components. FOSS components are called "Supplied Software" in the OpenChain specification.
ko: 회사는 독점 컴포넌트를 위한 유사한 프로세스를 가질 수 있습니다. FOSS 컴포넌트는 OpenChain 설명서에서 "공급 대상 소프트웨어 (Supplied Software)"라고 불립니다.

source: Companies pick the solution most suited to their specific market area and product
ko: 회사들은 특정 시장 영역 및 제품에 가장 적합한 솔루션을 선택해야 합니다.

source: Compile notices
ko: 공개를 위한 컴파일 고지

source: Compiling into binary
ko: 바이너리로 컴파일

source: Compliance Process
ko: 컴플라이언스 프로세스

source: Compliance management is a set of actions that manages OSS components used in products.
ko: 컴플라이언스 관리는 제품에 사용되는 FOSS 컴포넌트를 관리하는 일련의 작업입니다.

source: Conduct review with reference to your FOSS policy
ko: FOSS 정책을 참고하여 리뷰를 수행합니다.

source: Confirm origin and
ko: 소스 코드의 출처와 라이선스 확인

source: Confirming that all obligations have been or will be met
ko: 모든 의무가 충족되었거나 충족될 것임을 확인

source: Consumer and brand protection; avoid consumer confusion and brand dilution
ko: 소비자 및 브랜드 보호; 소비자 혼란과 브랜드 가치 저하 방지

source: Contents
ko: 목차

source: Converting C++ to Java
ko: C++에서 Java로 변환

source: Copyright Concepts in Software
ko: 소프트웨어의 저작권 개념

source: Copyright Rights Most Relevant to Software
ko: 소프트웨어와 가장 관련이있는 저작권상의 권리

source: Copyright generally applies to literary works, such as books, movies, pictures, music, maps
ko: 저작권은 일반적으로 책, 영화, 그림, 음악, 지도와 같은 문학 작품에 적용

source: Copyright notices, attribution, source code for vendor modifications if needed to satisfy license obligations
ko: 라이선스 의무를 충족시키기 위해 필요한 저작권 고지, 귀속에 대한 고지, 공급 업체의 수정 소스 코드

source: Copyright owner
ko: 저작권 소유자

source: Copyright: protects original works of authorship
ko: 저작권: 저자의 원본 저작물을 보호

source: Creating interdependency
ko: 상호의존성 생성

source: Customer/Partner
ko: 고객/파트너

source: Deleting
ko: 삭제

source: Deleting or removing code
ko: 코드 삭제 또는 제거

source: Description of modifications intended to be made
ko: 만들고자하는 수정사항에 대한 설명

source: Developer Guidelines
ko: 개발자 가이드라인

source: Development Tools
ko: 개발 도구

source: Development team's point of contact
ko: 개발팀의 연락 지점

source: Development team's point of contact in case you need to follow up with future FOSS issues.
ko: 향후 FOSS 이슈를 해결해야 할 경우를 위한 개발팀의 연락처입니다.

source: Development tools may perform some of these operations behind the scenes.
ko: 개발 도구가 이러한 작업 중 일부를 내부적으로 수행할 수 있습니다.

source: Different legal jurisdictions may have different legal requirements.This should be taken into account when using these slides as part of a compliance training program.
ko: 법적인 관할권에 따라 법적 요구 사항이 달라질 수 있습니다.이 슬라이드를 Compliance 교육 프로그램의 일부로 사용할 때는이 점을 고려해야합니다.

source: Different use cases will have different legal effects.
ko: 사용 사례가 다르면 법적 효력이 달라집니다.

source: Discover all FOSS early in the procurement/development cycle
ko: 구매/개발 주기 초반에 모든 FOSS의 발견합니다.

source: Distribution
ko: 배포

source: Distribution is generally viewed as the provision of a copy of a piece of software,in binary or source code form, to another entity (an individual or organization outsideyour company or organization)
ko: 배포는 일반적으로 바이너리 또는 소스 코드 형식의 소프트웨어 사본을 다른 엔터티 (회사 또는 조직 외부의 개인 또는 조직)에게 제공하는 것으로 간주됨

source: Does not protect abstract ideas, laws of nature
ko: 추상적인 아이디어, 자연의 법칙을 보호하지는 않음

source: Does the declared license match what is in the code files?
ko: 선언된 라이선스가 코드 파일에 있는 것과 일치합니까?

source: Does the license permit use with other components of the software?
ko: 라이선스는 소프트웨어의 다른 컴포넌트와 사용을 허용합니까?

source: Download or source code URL
ko: 다운로드 또는 소스 코드 URL

source: Due diligence of 3rd-party software
ko: 타사 소프트웨어의 실사

source: E.g, provide attribution, or give a reciprocal license
ko: 예: 저작자 표시 또는 상호 라이선스 제공

source: End to End Compliance Management (Example Processes)
ko: 엔드 투 엔드 컴플라이언스 관리 (프로세스 예)

source: End to End Compliance Management(Example Process)
ko: 엔드 투 엔드 컴플라이언스 관리(프로세스 예)

source: Engineer
ko: 엔지니어

source: Engineering Specialists working with business interests, commercial licensing, export compliance, etc., who may be impacted by FOSS usage
ko: 사업 수익, 상용 라이선싱, 수출 컴플라이언스를 담당하는 엔지니어링 전문가 (FOSS 사용의 영향을 받을 수 있음)

source: Engineering or developer teams may participate in gathering relevant information
ko: 엔지니어링 팀 또는 개발자 팀이 관련 정보 수집에 참여할 수 있습니다.

source: Ensure adequate compliance staffing and designate clear lines of responsibility
ko: 적절한 컴플라이언스 인력을 확보하고 명확한 책임 사항을 지정합니다.

source: Ensure the software in the audit report conforms with FOSS policies
ko: 검사 보고서 내의 소프트웨어가 FOSS 정책을 준수하는지 확인하십시오.

source: Ensure you have the notices and source code as needed to meet these obligations.
ko: 이러한 의무를 충족하기 위해 필요한 고지문과 소스 코드가 있는지 확인합니다.

source: Example Enterprise Process
ko: 예: 기업 프로세스

source: Example Small to Medium Company Checklist
ko: 예: 중소 기업 체크리스트

source: Example of Compliance Management End-to-End Process
ko: 예 : 컴플라이언스 관리 엔드-투-엔드 프로세스

source: Example of license reciprocity from the GPL version 2.0:
ko: GPL-2.0의 라이선스 상호주의 예:

source: Example: BSD-3-Clause
ko: 예: BSD-3-Clause

source: Examples include:
ko: 예:

source: Exclusive or non-exclusive terms
ko: 배타적 또는 비배타적인 조건

source: Executive Review Committee
ko: 경영진 리뷰 위원회

source: FOSS Licenses
ko: FOSS 라이선스

source: FOSS Policy
ko: FOSS 정책

source: FOSS Review
ko: FOSS 리뷰

source: FOSS Review Oversight
ko: FOSS 리뷰 감독

source: FOSS Review Team
ko: FOSS 리뷰 팀

source: FOSS Training Reference Slides for the OpenChain Specification 1.1
ko: OpenChain 설명서 1.1을 위한 FOSS 교육 참조 슬라이드

source: FOSS developers often use the term “proprietary” to describe a commercial non-FOSS license, even though both FOSS and proprietary licenses are based on intellectual property and provide a license grant to that property
ko: FOSS 개발자는 FOSS 및 독점 라이선스가 모두 지적 재산을 기반으로하고 해당 자산에 라이센스 부여를 제공함에도, 상업적 비 FOSS 라이선스를 설명하기 위해 종종 "독점"이라는 용어를 사용함

source: FOSS identified;
ko: FOSS 식별

source: FOSS licenses by definition make source code available under terms that allow for modification and redistribution
ko: 정의에 따르면 FOSS 라이선스는 수정 및 재배포를 허용하는 조건하에서 소스 코드를 사용할 수 있게함

source: FOSS licenses may have conditions related to providing attributions, copyright statement preservation, or a written offer to make the source code available
ko: FOSS 라이선스는 귀속에 관한 고지 제공, 저작권 표시 보존 또는 소스 코드 제공을 위한 서면 청약과 관련된 조건을 가지고 있을 수 있음

source: Final Verifications
ko: 최종 확인

source: First product release that will include the package
ko: 패키지를 포함하는 첫번째 제품의 출시

source: First, you may need to follow up with the vendor if FOSS issues arise in the future, and having a reliable point of contact is important. You may also need to meet FOSS license obligations for FOSS delivered from the vendor.
ko: 첫째, 미래에 FOSS 문제가 발생할 경우 공급 업체와 후속 조치를 취해야 할 수 있있으며, 신뢰할 수 있는 연락처를 갖고 있는 것은 중요합니다. 또한 공급 업체가 제공한 FOSS에 대한 FOSS 라이선스 의무를 준수해야 할 수도 있습니다.

source: Fixing
ko: 조정 (Fixing)

source: Fixing, optimizing or making changes to the FOSS component
ko: FOSS 컴포넌트의 수정, 최적화 또는 변경

source: For example, a tool may inject portions of its own code into output of the tool.
ko: 예를 들어, 어떤 도구는 출력물에 자체 코드의 일부를 주입할 수 있습니다.

source: For example, code scanning may be used to locate undisclosed FOSS usage.
ko: 예를 들어, 코드 스캐닝은 공개되지 않은 FOSS의 사용을 찾기 위해 사용될 수 있습니다.

source: Freeware software is usually fully functional (no locked features) and available for unlimited use (no locking on days of usage)
ko: 프리웨어 소프트웨어는 일반적으로 완벽하게 작동하며 (기능 제한 없음) 무제한으로 사용할 수 있음 (사용일수 제한 없음).

source: Freeware software licenses usually impose restrictions in relation to copying, distributing, and making derivative works of the software, as well as restrictions on the type of usage (personal, commercial, academic, etc.)
ko: 프리웨어 소프트웨어 라이선스는 일반적으로 사용 유형 (개인, 상업, 학업 등)에 대한 제한 뿐만 아니라 소프트웨어의 복제, 배포 및 파생 저작물 제작과 관련하여 제한을 부과함

source: Freeware – software distributed under a proprietary license at noor very low cost
ko: 프리웨어 – 독점 라이선스 하에서 무료 또는 매우 저렴한 비용으로 배포되는 소프트웨어

source: Gather relevant information
ko: 관련 정보 수집

source: Geographical scope
ko: 지리적 범위

source: Guidance
ko: 가이드

source: Hardware
ko: 하드웨어

source: Have training on the organization’s FOSS policy available to everyone
ko: 조직의 FOSS 정책에 대한 교육을 모든 사람이 받을 수 있게 합니다.

source: How can they raise questions about FOSS usage?
ko: FOSS 사용에 대해 어떻게 질문 할 수 있습니까?

source: How do you want to use a FOSS component?
ko: FOSS 컴포넌트를 어떻게 사용하려고 합니까?

source: How is the FOSS component distributed?
ko: FOSS 컴포넌트가 어떻게 배포됩니까?

source: However, the amount of information required depends on the size of your company and what you intend to do with the FOSS code.
ko: 그러나 필요한 정보의 양은 회사의 규모와 FOSS 코드로 하려는 의도에 따라 달라집니다.

source: Identification
ko: 식별

source: Identify FOSS components
ko: FOSS 컴포넌트 식별

source: Identify FOSS components for review
ko: 리뷰를 위해 FOSS 컴포넌트 식별

source: Identify FOSS licenses
ko: FOSS 라이선스 식별

source: Identify and Track FOSS Usage
ko: FOSS 사용의 확인 및 추적

source: Identifying all the FOSS components used in Supplied Software
ko: 공급 대상 소프트웨어에 사용된 모든 FOSS 컴포넌트 식별

source: Identifying and tracking all obligations created by those components
ko: 해당 컴포넌트가 요구하는 모든 의무를 식별하고 추적

source: If from an external vendor:
ko: 외부 공급 업체로부터 입수한 경우:

source: If you independently develop your own software, is it possible thatyou might need a copyright license from a third party for that software?A patent license?
ko: 자신의 소프트웨어를 독자적으로 개발하는 경우, 해당 소프트웨어에 대한 제3자의 저작권 라이선스가 필요할 수 있습니까? 특허 라이선스는 어떻습니까?

source: Important questions to ask include:
ko: 중요한 질문은 다음과 같습니다:

source: In general it refers to a new work based upon an original work to which enough original creative work has been added so that the new work represents an original work of authorship rather than a copy
ko: 일반적으로 충분한 저작 활동이 추가된 독창적인 저작물을 기반으로 한 새로운 저작물을 말하며, 이는 새로운 저작물이 사본이 아닌 원본 저작물을 나타내는 것임

source: Include appropriate authority levels in review staff
ko: 리뷰 직원에게 적절한 수준의 권한을 부여합니다.

source: Includes Binary Code and Source Code
ko: 바이너리 코드 및 소스 코드 포함

source: Incoming
ko: 유입

source: Incoming requests from engineering
ko: 엔지니어링으로부터 요청 접수

source: Incoming:
ko: 들어옴:

source: Incorporation
ko: 결합

source: Incorporation is when you copy portions of a FOSS component into your software product.
ko: 결합은 FOSS 컴포넌트의 일부를 소프트웨어 제품에 복사하는 것입니다.

source: Inform the end user of the product on how to obtain a copy of the FOSS source code (when applicable, for example in the case of GPL and LGPL)
ko: FOSS 소스 코드의 사본을 얻는 방법에 대해 제품의 최종 사용자에게 알립니다(해당하는 경우. 예: GPL 및 LGPL).

source: Infringement may occur even if other parties independently create the same invention
ko: 다른 당사자가 독자적으로 동일한 발명을 독자적으로 창작하더라도 침해가 발생할 수 있음

source: Infringement may occur if copying without the permission of the author
ko: 저자의 허락없이 복사하는 경우 저작권 침해가 발생할 수 있음

source: Initiate a FOSS Review
ko: FOSS 리뷰를 시작하세요

source: Initiate a FOSS review process or contact the FOSS review team.
ko: FOSS 리뷰 프로세스를 시작하거나 FOSS 리뷰팀에 문의하십시오.

source: Initiate a FOSS review process.
ko: FOSS 리뷰 프로세스를 시작합니다.

source: Initiating a FOSS Review
ko: FOSS 리뷰 시작하기

source: Inject material
ko: 자료 주입

source: Injecting
ko: 주입 (Injecting)

source: Inserting
ko: 삽입 (Inserting)

source: Integrating
ko: 통합 (Integrating)

source: Intended use in your product
ko: 제품 내 사용 의도

source: Introduction
ko: 소개

source: Introduction to FOSS Compliance
ko: FOSS Compliance 소개

source: Introduction to FOSS Licenses
ko: FOSS 라이선스 소개

source: Is the code and associated information complete, consistent and accurate?
ko: 코드 및 관련 정보가 완전하고 일관되며 정확한 것입니까?

source: Is there a regular point in your development process where FOSS Reviews can begin?
ko: 개발 프로세스에 FOSS 리뷰가 시작될 수 있는 정규 지점이 있습니까?

source: Issues that need resolving
ko: 해결이 필요한 문제

source: It covers software, books, and similar works
ko: 소프트웨어, 서적 및 이와 유사한 저작물을 다룸

source: It is a “term of art” meaning that it has a particular meaning based on the statute and not the dictionary definition
ko: 사전 정의가 아닌 법령에 근거한 특별한 의미를 갖는 "예술 용어"임

source: It should be interactive to ensure all those groups correctly understand the issues and can create clear, shared guidance.
ko: 모든 그룹이 문제를 정확히 이해하고 명확하고 공유된 가이드를 만들 수 있도록 상호 작용해야 합니다.

source: It should be noted that this list of information looks quite large.
ko: 이 정보 목록은 상당히 커 보인다는 점에 유의해야합니다.

source: Kernel Space
ko: 커널 영역

source: Key Software Conceptsfor FOSS Review
ko: FOSS 리뷰를 위한주요 소프트웨어 개념

source: Large entities tend to require more information than small entities.
ko: 대기업은 작은 기업보다 더 많은 정보를 요구하는 경향이 있습니다.

source: Learn more at: https://www.openchainproject.org
ko: 자세한 내용은 다음을 참조하십시오: https://www.openchainproject.org

source: Legal
ko: 법무팀

source: Legal teams analyze and determine license obligations and provide guidance
ko: 법률 팀은 라이선스 의무를 분석 및 결정하고 가이드를 제공합니다.

source: Legal to identify and evaluate license obligations
ko: 라이선스 의무를 확인하고 평가하는 법무팀

source: Legend
ko: 범례

source: License Reciprocity & Copyleft Licenses
ko: 라이선스 상호주의 및 Copyleft 라이선스

source: License and License URL
ko: 라이선스 및 라이선스 URL

source: Licenses
ko: 라이선스

source: Licenses that include reciprocity or Copyleft clauses include all versions of the GPL, LGPL, AGPL, MPL and CDDL
ko: 상호주의 또는 Copyleft 절을 포함하는 라이선스에는 GPL, LGPL, AGPL, MPL 및 CDDL의 모든 버전이 포함됨

source: Likewise, the engineering team may need assistance in implementing guidance from the FOSS review team.
ko: 마찬가지로, 엔지니어링팀은 FOSS 리뷰팀의 가이드를 이행하는데 도움이 필요할 수 있습니다.

source: Limited monopoly to incentivize innovation
ko: 혁신을 장려하기위한 제한된 독점

source: Linking
ko: 링킹

source: Linking is when you link or join a FOSS component with your software product.
ko: 링킹은 소프트웨어 제품과 FOSS 컴포넌트를 링크하거나 연결하는 것입니다.

source: List of dependencies
ko: Dependency 목록

source: Location where the source code will be maintained
ko: 소스 코드가 유지될 위치

source: Manual recognition of new components added to the repository
ko: 저장소에 추가된 새로운 컴포넌트에 대한 수동 인식

source: Many companies use both an automated tool and manual review
ko: 많은 회사들은 자동화된 도구와 수동 검토를 모두 사용합니다.

source: May also include contractual terms regarding warranties, indemnification, support, upgrade, maintenance
ko: 보증, 배상, 지원, 업그레이드, 유지 보수와 관련된 계약 조건도 포함될 수 있음

source: Merging
ko: 병합 (Merging)

source: Modification
ko: 수정

source: Modification is when you make changes to a FOSS component.
ko: 수정은 FOSS 컴포넌트를 변경하는 것입니다.

source: Modify the material
ko: 자료 수정

source: Most companies are very leery of Shareware, because Shareware vendors often approach companies for large license payments after the software has freely propagated within their organizations.
ko: 셰어웨어 공급 업체는 소프트웨어가 조직 내에서 자유롭게 전파 된 후 대규모 라이슨서 지불을 위해 회사에 접근하기 때문에 대부분의 회사는 셰어웨어를 매우 경계함

source: Not the functionality (that’s protected by patents) but the expression (creativity in implementation details)
ko: 기능(특허로 보호됨)이 아니라 표현(구현 세부 사항의 창의성)이 보호를 받음

source: Note: The interpretation of what constitutes a “derivative work” or a “distribution”is subject to debate in the FOSS community and within FOSS legal circles
ko: 참고 : "파생 저작물"또는 "배포"을 구성하는 내용에 대한 해석은 FOSS 커뮤니티 및 FOSS 법률 집단 내의 토론 대상이 됨

source: Note: The process often starts when new FOSS-based software is selected by engineering or outside vendors.
ko: 참고: 프로세스는 주로 엔지니어 또는 외부 공급 업체가 새로운 FOSS 기반 소프트웨어가 선택하면 시작됩니다.

source: Notices
ko: 고지

source: Notices & Attributions
ko: 고지 & 귀속에 관한 고지

source: Obligations met
ko: 의무 충족

source: Obligations to provide accompanying source code are met
ko: 수반되는 소스 코드를 제공하기 위한 의무가 충족됩니다.

source: Once a FOSS component has been approved for usage in a product, it should be added to the software inventory for that product
ko: 제품 사용에 대한 FOSS 컴포넌트가 승인되면 해당 제품의 소프트웨어 목록에 추가해야합니다.

source: Once the proposed FOSS usage has been fully assessed, the legal team will then have the necessary information on which to make its judgments.
ko: 제안된 FOSS 사용이 완전히 평가되면, 법무팀은 판단을 내리는데 필요한 정보를 갖게되는 것입니다.

source: One popular set of licenses are those approved by the FOSS Initiative (OSI) based on their FOSS Definition (OSD).
ko: 하나의 인기있는 라이선스 집합은 FOSS 정의 (OSD)를 기반으로 FOSS Initiative (OSI)에서 승인한 라이선스 집합임

source: Ongoing Compliance Tasks:
ko: 지속적인 컴플라이언스 과제:

source: Optimizing
ko: 최적화 (Optimizing)

source: Other Non-FOSS Licensing Situations
ko: 기타 비 FOSS 라이선스 상황

source: Other examples: MIT, Apache-2.0
ko: 다른 예: MIT, Apache-2.0

source: Other parties who want to use the technology may seek a patent license (which may grant rights to use, make, have made, sell, offer for sale, and import the technology)
ko: 그 기술을 사용하고자하는 다른 당사자는 특허 라이선스(사용, 제작, 판매, 판매 제안 및 기술 도입 권한을 부여 할 수 있음)를 요청할 수 있음.

source: Other specialists or representatives that may be impacted by FOSS-related issues, such as commercial licensing, compliance or business planning teams.
ko: FOSS 관련 문제의 영향을 받을 수있는 다른 전문가 또는 대표자 (예 : 상용 라이선스, 컴플라이언스 또는 사업 계획팀).

source: Outcome:
ko: 결과:

source: Outgoing Software
ko: 유출 소프트웨어

source: Outgoing:
ko: 나감:

source: Own Proprietary Software
ko: 자체 독점 소프트웨어

source: Package name
ko: 패키지 이름

source: Packaging
ko: 패키징

source: Pairing
ko: 페어링

source: Pasting
ko: 붙여넣기 (Pasting)

source: Patent Concepts in Software
ko: 소프트웨어의 특허 개념

source: Patents protect functionality – this can include a method of operation,such as a computer program
ko: 특허는 기능을 보호함 – 컴퓨터 프로그램과 같은 작동 방법을 포함 할 수 있음

source: Patents: useful inventions that are novel and non-obvious
ko: 특허: 새롭고 너무 뻔하지 않은 유용한 발명품
